﻿﻿﻿﻿//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:  <NCT5538DHwmSetup.uni>
//
// Description: HWM form string definitions.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"
//If customer define the common logical device by themselves, add here.

//
// HardWare Monitor 
//
#string STR_NCT5538D_HMM_CONFIGURATION                   #language eng "Hardware Monitor"
#string STR_NCT5538D_HMM_CONFIGURATION_HELP              #language eng "Monitor hardware status"

#string STR_PC_HEALTH                                    #language eng "Pc Health Status"
#string STR_NCT5538D_HMM_VIN0                            #language eng "VIN0"
#string STR_NCT5538D_HMM_VIN0_VALUE                      #language eng "N/A"
#string STR_NCT5538D_HWM_AVCC                            #language eng "AVCC"
#string STR_NCT5538D_HWM_AVCC_VALUE                      #language eng "N/A"
#string STR_NCT5538D_HWM_VTT                             #language eng "VTT"
#string STR_NCT5538D_HWM_VTT_VALUE                       #language eng "N/A"
#string STR_NCT5538D_HWM_CPUVCORE                        #language eng "CPUVCORE"
#string STR_NCT5538D_HWM_CPUVCORE_VALUE                  #language eng "N/A"
#string STR_NCT5538D_HWM_VCOREREFIN                      #language eng "VCOREREFIN"
#string STR_NCT5538D_HWM_VCOREREFIN_VALUE                #language eng "N/A"
// >> 2016/07/19 AAEON_OVERRIDE
#string STR_NCT5538D_SMARTFAN_FORM		         #language eng "Smart Fan Configuration"
#string STR_CPU_FAN_ONOFF			         #language eng "CPU Smart Fan Control"
#string STR_CPU_FAN_ONOFF_HELP			         #language eng "Enable/Disable CPU Smart Fan Function"
#string STR_SYS_FAN_ONOFF			         #language eng "System Smart Fan Control"
#string STR_SYS_FAN_ONOFF_HELP			         #language eng "Enable/Disable System Smart Fan Function"
#string STR_AUX0_FAN_ONOFF			         #language eng "Aux 0 Smart Fan Control"
#string STR_AUX0_FAN_ONOFF_HELP			         #language eng "Enable/Disable Aux 0 Smart Fan Function"
#string STR_AUX1_FAN_ONOFF			         #language eng "Aux 1 Smart Fan Control"
#string STR_AUX1_FAN_ONOFF_HELP			         #language eng "Enable/Disable Aux 1 Smart Fan Function"
#string STR_HWM_CPU_DTS_TEMP               		 #language eng "CPU temperature (DTS)"
#string STR_HWM_CPU_DTS_TEMP_VALUE         		 #language eng "N/A"
#string STR_FAN_CTRL_MODE			         #language eng "  Fan Control Mode"
#string STR_FAN_CTRL_MODE_HELP			         #language eng "Fan control mode selection"
#string STR_MANUAL_MODE				         #language eng "Manual Mode"
#string STR_THRM_CRUISE_MODE			         #language eng "Thermal Cruise Mode"
#string STR_SPEED_CRUISE_MODE			         #language eng "Speed Cruise Mode"
#string STR_SMART_FAN_IV_MODE			         #language eng "SMART FAN IV Mode"
#string STR_FAN_OUT_VALUE			         #language eng "  PWM/DC Voltage Output"
#string STR_FAN_OUT_VALUE_HELP			         #language eng "Input expect PWM/DC Voltage Output Value \n(Range:0 - 255)"
#string STR_FAN_TEMP_SRC			         #language eng "  Temperature Source"
#string STR_FAN_TEMP_SRC_HELP			         #language eng "Temperature Source Selection"
#string STR_SYSTIN			     	         #language eng "SYSTIN"
#string STR_CPUTIN			     	         #language eng "CPUTIN"
#string STR_AUXTIN0			     	         #language eng "AUXTIN0"
#string STR_AUXTIN1			     	         #language eng "AUXTIN1"
#string STR_AUXTIN2			     	         #language eng "AUXTIN2"
#string STR_AUXTIN3			     	         #language eng "AUXTIN3"
#string STR_SMBUS_MASTER_0			         #language eng "SMBUSMASTER 0"
#string STR_SMBUS_MASTER_1			         #language eng "SMBUSMASTER 1"
#string STR_SMBUS_MASTER_2			         #language eng "SMBUSMASTER 2"
#string STR_SMBUS_MASTER_3			         #language eng "SMBUSMASTER 3"
#string STR_SMBUS_MASTER_4			         #language eng "SMBUSMASTER 4"
#string STR_SMBUS_MASTER_5			         #language eng "SMBUSMASTER 5"
#string STR_SMBUS_MASTER_6			         #language eng "SMBUSMASTER 6"
#string STR_SMBUS_MASTER_7			         #language eng "SMBUSMASTER 7"
#string STR_PECI_AGENT_0			         #language eng "PECI Agent 0"
#string STR_PECI_AGENT_1			         #language eng "PECI Agent 1"
#string STR_PCH_CHIP_CPU_MAX_TEMP		         #language eng "PCH_CHIP_CPU_MAX_TEMP"
#string STR_PCH_CHIP_TEMP		     	         #language eng "PCH_CHIP_TEMP"
#string STR_PCH_CPU_TEMP		     	         #language eng "PCH_CPU_TEMP"
#string STR_PCH_MCH_TEMP		     	         #language eng "PCH_MCH_TEMP"
#string STR_PCH_DIM0_TEMP		     	         #language eng "PCH_DIM0_TEMP"
#string STR_PCH_DIM1_TEMP		     	         #language eng "PCH_DIM1_TEMP"
#string STR_PCH_DIM2_TEMP		     	         #language eng "PCH_DIM2_TEMP"
#string STR_PCH_DIM3_TEMP		     	         #language eng "PCH_DIM3_TEMP"
#string STR_BYTE_TEMP		     	     	         #language eng "BYTE_TEMP"
#string STR_VIRTUAL_TEMP		     	         #language eng "Virtual_TEMP"
#string STR_FAN_TARGET_TEMP			         #language eng "  Target Temperature"
#string STR_FAN_TARGET_TEMP_HELP		         #language eng "Input Fan control Target Temperature \n(Range:0 - 127)"
#string STR_FAN_TEMP_TOLERANCE 			         #language eng "  Tolerance of Temperature"
#string STR_FAN_TEMP_TOLERANCE_HELP		         #language eng "Input Tolerance of Target Temperature \n(Range:0 - 7)"
#string STR_FAN_OUTPUT_MODE 			         #language eng "  Fan Out Mode"
#string STR_FAN_OUTPUT_MODE_HELP		         #language eng "Select Fan Output Mode"
#string STR_PWM_MODE				         #language eng "PWM Mode"
#string STR_DC_MODE				         #language eng "DC Mode"
#string STR_FAN_START_UP_VALUE 			         #language eng "  Fan Out Start-Up Value"
#string STR_FAN_START_UP_VALUE_HELP		         #language eng "Input Fan Out Start-Up Value \n(Range:0 - 255)"
#string STR_FAN_STOP_DUTY			         #language eng "  Fan Stop Duty"
#string STR_FAN_STOP_DUTY_HELP		     	         #language eng "Fan Stop Duty Mode\nDown to 0:\nFANOUT will decrease to 0 value at most if necessary.\n\nTo Fan Out Stop Value:\nSame as Fan Out Stop Value"
#string STR_DOWN_TO_ZERO			         #language eng "Down to 0"
#string STR_DOWN_TO_FAN_STOP_VALUE		         #language eng "To Fan Out Stop Value"
#string STR_FAN_STOP_VALUE 			         #language eng "  Fan Out Stop Value"
#string STR_FAN_STOP_VALUE_HELP			         #language eng "The Fan Out value decreases to this value if the temperature stays below the lowest temperature limit. \n(Range:0 - 255)"
#string STR_FAN_STOP_TIME 			         #language eng "  Fan Out Stop Time"
#string STR_FAN_STOP_TIME_HELP			         #language eng "Determines the amount of time it takes Fan Out value to fall from the stop value to zero. \n(Range:0 - 255)"
#string STR_FAN_STEP_UP_TIME 			         #language eng "  Fan Out Step Up Time"
#string STR_FAN_STEP_UP_TIME_HELP		         #language eng "Determines the amount of time Fan Out takes to increase its value by one step. \nThe units are intervals of 0.1 second. \n(Range:0 - 255)"
#string STR_FAN_STEP_DOWN_TIME 			         #language eng "  Fan Out Step Down Time"
#string STR_FAN_STEP_DOWN_TIME_HELP		         #language eng "Determines the amount of time Fan Out takes to decrease its value by one step. \nThe units are intervals of 0.1 second. \n(Range:0 - 255)"
#string STR_CRITICAL_TEMP 			         #language eng "  Critical Temperature"
#string STR_CRITICAL_TEMP_HELP		     	         #language eng "Determines the amount of time Fan Out takes to decrease its value by one step. \n(Range:0 - 255)"
#string STR_TARGET_SPEED 			         #language eng "  Target Speed"
#string STR_TARGET_SPEED_HELP		     	         #language eng "Determines the Fan target speed. \n(Range:0 - 4096)"
#string STR_SPEED_TOL 			     	         #language eng "  Speed Tolerance"
#string STR_SPEED_TOL_HELP		     	         #language eng "Determines the tolerance of Fan Target Speed. \n(Range:0 - 64)"
#string STR_FAN_CLS_LOOP_MODE			         #language eng "  Close-Loop Fan Mode"
#string STR_FAN_CLS_LOOP_MODE_HELP		         #language eng "En/Disable Smart Fan IV Close Loop Fan Control RPM Mode"
#string STR_FAN_TEMP1				         #language eng "  Temperature 1"
#string STR_FAN_TEMP1_HELP			         #language eng "Determines the amount of Temperature 1 for Smart Fan IV Mode. \n(Range:0 - 255)"
#string STR_FAN_TEMP2				         #language eng "  Temperature 2"
#string STR_FAN_TEMP2_HELP			         #language eng "Determines the amount of Temperature 2 for Smart Fan IV Mode. \n(Range:0 - 255)"
#string STR_FAN_TEMP3				         #language eng "  Temperature 3"
#string STR_FAN_TEMP3_HELP			         #language eng "Determines the amount of Temperature 3 for Smart Fan IV Mode. \n(Range:0 - 255)"
#string STR_FAN_TEMP4				         #language eng "  Temperature 4"
#string STR_FAN_TEMP4_HELP			         #language eng "Determines the amount of Temperature 4 for Smart Fan IV Mode. \n(Range:0 - 255)"
#string STR_FAN_PWM1				         #language eng "  Fan PWM 1"
#string STR_FAN_PWM1_HELP			         #language eng "Determines the amount of Fan PWM 1 for Smart Fan IV Mode. \n(Range:0 - 255)"
#string STR_FAN_PWM2				         #language eng "  Fan PWM 2"
#string STR_FAN_PWM2_HELP			         #language eng "Determines the amount of Fan PWM 2 for Smart Fan IV Mode. \n(Range:0 - 255)"
#string STR_FAN_PWM3				         #language eng "  Fan PWM 3"
#string STR_FAN_PWM3_HELP			         #language eng "Determines the amount of Fan PWM 3 for Smart Fan IV Mode. \n(Range:0 - 255)"
#string STR_FAN_PWM4				         #language eng "  Fan PWM 4"
#string STR_FAN_PWM4_HELP			         #language eng "Determines the amount of Fan PWM 4 for Smart Fan IV Mode. \n(Range:0 - 255)"
#string STR_CRITICAL_TEMP_TOL 			         #language eng "  Critical Temp Tolerance"
#string STR_CRITICAL_TEMP_TOL_HELP		         #language eng "Input Tolerance of Critical Temperature. \n(Range:0 - 7)"
#string STR_COUNT_STEP_UP			         #language eng "  Fan Count Step Up"
#string STR_COUNT_STEP_UP_HELP			         #language eng "Input Fan Count Up Unit. \n(Range:0 - 15)"
#string STR_COUNT_STEP_DOWN			         #language eng "  Fan Count Step Down"
#string STR_COUNT_STEP_DOWN_HELP		         #language eng "Input Fan Count Down Unit. \n(Range:0 - 15)"
// << 2016/07/19 AAEON_OVERRIDE


//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2015, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**      5555 Oakbrook Parkway, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************
